{
    "@odata.type": "#microsoft.graph.deviceAndAppManagementRoleDefinition",
    "displayName": "EUD-Intune-Admin",
    "description": "",
    "isBuiltInRoleDefinition": false,
    "isBuiltIn": false,
    "roleScopeTagIds": ["{tag-eud}"],
    "permissions": [
        {
            "actions": [
                "Microsoft.Intune_AndroidSync_Read",
                "Microsoft.Intune_AppleDeviceSerialNumbers_Read",
                "Microsoft.Intune_AppleEnrollmentProfiles_Read",
                "Microsoft.Intune_Audit_Read",
                "Microsoft.Intune_CorporateDeviceIdentifiers_Read",
                "Microsoft.Intune_DeviceCompliancePolices_Assign",
                "Microsoft.Intune_DeviceCompliancePolices_Create",
                "Microsoft.Intune_DeviceCompliancePolices_Delete",
                "Microsoft.Intune_DeviceCompliancePolices_Read",
                "Microsoft.Intune_DeviceCompliancePolices_Update",
                "Microsoft.Intune_DeviceCompliancePolices_ViewReports",
                "Microsoft.Intune_DeviceConfigurations_Assign",
                "Microsoft.Intune_DeviceConfigurations_Create",
                "Microsoft.Intune_DeviceConfigurations_Delete",
                "Microsoft.Intune_DeviceConfigurations_Read",
                "Microsoft.Intune_DeviceConfigurations_Update",
                "Microsoft.Intune_DeviceConfigurations_ViewReports",
                "Microsoft.Intune_DeviceEnrollmentManagers_Read",
                "Microsoft.Intune_EndpointProtection_Read",
                "Microsoft.Intune_EnrollmentProgramToken_Read",
                "Microsoft.Intune_ManagedApps_Assign",
                "Microsoft.Intune_ManagedApps_Create",
                "Microsoft.Intune_ManagedApps_Delete",
                "Microsoft.Intune_ManagedApps_Read",
                "Microsoft.Intune_ManagedApps_Update",
                "Microsoft.Intune_ManagedApps_Wipe",
                "Microsoft.Intune_ManagedDevices_Read",
                "Microsoft.Intune_ManagedDevices_ViewReports",
                "Microsoft.Intune_MicrosoftStoreForBusiness_Read",
                "Microsoft.Intune_MobileApps_Read",
                "Microsoft.Intune_MobileApps_ViewReports",
                "Microsoft.Intune_Organization_Read",
                "Microsoft.Intune_PolicySets_Read",
                "Microsoft.Intune_RemoteAssistance_Read",
                "Microsoft.Intune_RemoteTasks_BypassActivationLock",
                "Microsoft.Intune_RemoteTasks_CleanPC",
                "Microsoft.Intune_RemoteTasks_ConfigurationManagerAction",
                "Microsoft.Intune_RemoteTasks_CustomNotification",
                "Microsoft.Intune_RemoteTasks_DeviceLogs",
                "Microsoft.Intune_RemoteTasks_DisableLostMode",
                "Microsoft.Intune_RemoteTasks_EnableLostMode",
                "Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent",
                "Microsoft.Intune_RemoteTasks_GetFileVaultKey",
                "Microsoft.Intune_RemoteTasks_LocateDevice",
                "Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers",
                "Microsoft.Intune_RemoteTasks_PlayLostModeSound",
                "Microsoft.Intune_RemoteTasks_RebootNow",
                "Microsoft.Intune_RemoteTasks_RemoteLock",
                "Microsoft.Intune_RemoteTasks_RequestRemoteAssistance",
                "Microsoft.Intune_RemoteTasks_ResetPasscode",
                "Microsoft.Intune_RemoteTasks_Retire",
                "Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses",
                "Microsoft.Intune_RemoteTasks_RotateBitLockerKeys",
                "Microsoft.Intune_RemoteTasks_RotateFileVaultKey",
                "Microsoft.Intune_RemoteTasks_SetDeviceName",
                "Microsoft.Intune_RemoteTasks_ShutDown",
                "Microsoft.Intune_RemoteTasks_SyncDevice",
                "Microsoft.Intune_RemoteTasks_UpdateDeviceAccount",
                "Microsoft.Intune_RemoteTasks_WindowsDefender",
                "Microsoft.Intune_RemoteTasks_Wipe",
                "Microsoft.Intune_Reports_Read",
                "Microsoft.Intune_Roles_Read",
                "Microsoft.Intune_SecurityBaselines_Read",
                "Microsoft.Intune_SecurityTasks_Read",
                "Microsoft.Intune_TelecomExpenses_Read",
                "Microsoft.Intune_TermsAndConditions_Read",
                "Microsoft.Intune_WindowsEnterpriseCertificate_Read"
            ],
            "resourceActions": [
                {
                    "allowedResourceActions": [
                        "Microsoft.Intune_AndroidSync_Read",
                        "Microsoft.Intune_AppleDeviceSerialNumbers_Read",
                        "Microsoft.Intune_AppleEnrollmentProfiles_Read",
                        "Microsoft.Intune_Audit_Read",
                        "Microsoft.Intune_CorporateDeviceIdentifiers_Read",
                        "Microsoft.Intune_DeviceCompliancePolices_Assign",
                        "Microsoft.Intune_DeviceCompliancePolices_Create",
                        "Microsoft.Intune_DeviceCompliancePolices_Delete",
                        "Microsoft.Intune_DeviceCompliancePolices_Read",
                        "Microsoft.Intune_DeviceCompliancePolices_Update",
                        "Microsoft.Intune_DeviceCompliancePolices_ViewReports",
                        "Microsoft.Intune_DeviceConfigurations_Assign",
                        "Microsoft.Intune_DeviceConfigurations_Create",
                        "Microsoft.Intune_DeviceConfigurations_Delete",
                        "Microsoft.Intune_DeviceConfigurations_Read",
                        "Microsoft.Intune_DeviceConfigurations_Update",
                        "Microsoft.Intune_DeviceConfigurations_ViewReports",
                        "Microsoft.Intune_DeviceEnrollmentManagers_Read",
                        "Microsoft.Intune_EndpointProtection_Read",
                        "Microsoft.Intune_EnrollmentProgramToken_Read",
                        "Microsoft.Intune_ManagedApps_Assign",
                        "Microsoft.Intune_ManagedApps_Create",
                        "Microsoft.Intune_ManagedApps_Delete",
                        "Microsoft.Intune_ManagedApps_Read",
                        "Microsoft.Intune_ManagedApps_Update",
                        "Microsoft.Intune_ManagedApps_Wipe",
                        "Microsoft.Intune_ManagedDevices_Read",
                        "Microsoft.Intune_ManagedDevices_ViewReports",
                        "Microsoft.Intune_MicrosoftStoreForBusiness_Read",
                        "Microsoft.Intune_MobileApps_Read",
                        "Microsoft.Intune_MobileApps_ViewReports",
                        "Microsoft.Intune_Organization_Read",
                        "Microsoft.Intune_PolicySets_Read",
                        "Microsoft.Intune_RemoteAssistance_Read",
                        "Microsoft.Intune_RemoteTasks_BypassActivationLock",
                        "Microsoft.Intune_RemoteTasks_CleanPC",
                        "Microsoft.Intune_RemoteTasks_ConfigurationManagerAction",
                        "Microsoft.Intune_RemoteTasks_CustomNotification",
                        "Microsoft.Intune_RemoteTasks_DeviceLogs",
                        "Microsoft.Intune_RemoteTasks_DisableLostMode",
                        "Microsoft.Intune_RemoteTasks_EnableLostMode",
                        "Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent",
                        "Microsoft.Intune_RemoteTasks_GetFileVaultKey",
                        "Microsoft.Intune_RemoteTasks_LocateDevice",
                        "Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers",
                        "Microsoft.Intune_RemoteTasks_PlayLostModeSound",
                        "Microsoft.Intune_RemoteTasks_RebootNow",
                        "Microsoft.Intune_RemoteTasks_RemoteLock",
                        "Microsoft.Intune_RemoteTasks_RequestRemoteAssistance",
                        "Microsoft.Intune_RemoteTasks_ResetPasscode",
                        "Microsoft.Intune_RemoteTasks_Retire",
                        "Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses",
                        "Microsoft.Intune_RemoteTasks_RotateBitLockerKeys",
                        "Microsoft.Intune_RemoteTasks_RotateFileVaultKey",
                        "Microsoft.Intune_RemoteTasks_SetDeviceName",
                        "Microsoft.Intune_RemoteTasks_ShutDown",
                        "Microsoft.Intune_RemoteTasks_SyncDevice",
                        "Microsoft.Intune_RemoteTasks_UpdateDeviceAccount",
                        "Microsoft.Intune_RemoteTasks_WindowsDefender",
                        "Microsoft.Intune_RemoteTasks_Wipe",
                        "Microsoft.Intune_Reports_Read",
                        "Microsoft.Intune_Roles_Read",
                        "Microsoft.Intune_SecurityBaselines_Read",
                        "Microsoft.Intune_SecurityTasks_Read",
                        "Microsoft.Intune_TelecomExpenses_Read",
                        "Microsoft.Intune_TermsAndConditions_Read",
                        "Microsoft.Intune_WindowsEnterpriseCertificate_Read"
                    ],
                    "notAllowedResourceActions": []
                }
            ]
        }
    ],
    "rolePermissions": [
        {
            "actions": [
                "Microsoft.Intune_AndroidSync_Read",
                "Microsoft.Intune_AppleDeviceSerialNumbers_Read",
                "Microsoft.Intune_AppleEnrollmentProfiles_Read",
                "Microsoft.Intune_Audit_Read",
                "Microsoft.Intune_CorporateDeviceIdentifiers_Read",
                "Microsoft.Intune_DeviceCompliancePolices_Assign",
                "Microsoft.Intune_DeviceCompliancePolices_Create",
                "Microsoft.Intune_DeviceCompliancePolices_Delete",
                "Microsoft.Intune_DeviceCompliancePolices_Read",
                "Microsoft.Intune_DeviceCompliancePolices_Update",
                "Microsoft.Intune_DeviceCompliancePolices_ViewReports",
                "Microsoft.Intune_DeviceConfigurations_Assign",
                "Microsoft.Intune_DeviceConfigurations_Create",
                "Microsoft.Intune_DeviceConfigurations_Delete",
                "Microsoft.Intune_DeviceConfigurations_Read",
                "Microsoft.Intune_DeviceConfigurations_Update",
                "Microsoft.Intune_DeviceConfigurations_ViewReports",
                "Microsoft.Intune_DeviceEnrollmentManagers_Read",
                "Microsoft.Intune_EndpointProtection_Read",
                "Microsoft.Intune_EnrollmentProgramToken_Read",
                "Microsoft.Intune_ManagedApps_Assign",
                "Microsoft.Intune_ManagedApps_Create",
                "Microsoft.Intune_ManagedApps_Delete",
                "Microsoft.Intune_ManagedApps_Read",
                "Microsoft.Intune_ManagedApps_Update",
                "Microsoft.Intune_ManagedApps_Wipe",
                "Microsoft.Intune_ManagedDevices_Read",
                "Microsoft.Intune_ManagedDevices_ViewReports",
                "Microsoft.Intune_MicrosoftStoreForBusiness_Read",
                "Microsoft.Intune_MobileApps_Read",
                "Microsoft.Intune_MobileApps_ViewReports",
                "Microsoft.Intune_Organization_Read",
                "Microsoft.Intune_PolicySets_Read",
                "Microsoft.Intune_RemoteAssistance_Read",
                "Microsoft.Intune_RemoteTasks_BypassActivationLock",
                "Microsoft.Intune_RemoteTasks_CleanPC",
                "Microsoft.Intune_RemoteTasks_ConfigurationManagerAction",
                "Microsoft.Intune_RemoteTasks_CustomNotification",
                "Microsoft.Intune_RemoteTasks_DeviceLogs",
                "Microsoft.Intune_RemoteTasks_DisableLostMode",
                "Microsoft.Intune_RemoteTasks_EnableLostMode",
                "Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent",
                "Microsoft.Intune_RemoteTasks_GetFileVaultKey",
                "Microsoft.Intune_RemoteTasks_LocateDevice",
                "Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers",
                "Microsoft.Intune_RemoteTasks_PlayLostModeSound",
                "Microsoft.Intune_RemoteTasks_RebootNow",
                "Microsoft.Intune_RemoteTasks_RemoteLock",
                "Microsoft.Intune_RemoteTasks_RequestRemoteAssistance",
                "Microsoft.Intune_RemoteTasks_ResetPasscode",
                "Microsoft.Intune_RemoteTasks_Retire",
                "Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses",
                "Microsoft.Intune_RemoteTasks_RotateBitLockerKeys",
                "Microsoft.Intune_RemoteTasks_RotateFileVaultKey",
                "Microsoft.Intune_RemoteTasks_SetDeviceName",
                "Microsoft.Intune_RemoteTasks_ShutDown",
                "Microsoft.Intune_RemoteTasks_SyncDevice",
                "Microsoft.Intune_RemoteTasks_UpdateDeviceAccount",
                "Microsoft.Intune_RemoteTasks_WindowsDefender",
                "Microsoft.Intune_RemoteTasks_Wipe",
                "Microsoft.Intune_Reports_Read",
                "Microsoft.Intune_Roles_Read",
                "Microsoft.Intune_SecurityBaselines_Read",
                "Microsoft.Intune_SecurityTasks_Read",
                "Microsoft.Intune_TelecomExpenses_Read",
                "Microsoft.Intune_TermsAndConditions_Read",
                "Microsoft.Intune_WindowsEnterpriseCertificate_Read"
            ],
            "resourceActions": [
                {
                    "allowedResourceActions": [
                        "Microsoft.Intune_AndroidSync_Read",
                        "Microsoft.Intune_AppleDeviceSerialNumbers_Read",
                        "Microsoft.Intune_AppleEnrollmentProfiles_Read",
                        "Microsoft.Intune_Audit_Read",
                        "Microsoft.Intune_CorporateDeviceIdentifiers_Read",
                        "Microsoft.Intune_DeviceCompliancePolices_Assign",
                        "Microsoft.Intune_DeviceCompliancePolices_Create",
                        "Microsoft.Intune_DeviceCompliancePolices_Delete",
                        "Microsoft.Intune_DeviceCompliancePolices_Read",
                        "Microsoft.Intune_DeviceCompliancePolices_Update",
                        "Microsoft.Intune_DeviceCompliancePolices_ViewReports",
                        "Microsoft.Intune_DeviceConfigurations_Assign",
                        "Microsoft.Intune_DeviceConfigurations_Create",
                        "Microsoft.Intune_DeviceConfigurations_Delete",
                        "Microsoft.Intune_DeviceConfigurations_Read",
                        "Microsoft.Intune_DeviceConfigurations_Update",
                        "Microsoft.Intune_DeviceConfigurations_ViewReports",
                        "Microsoft.Intune_DeviceEnrollmentManagers_Read",
                        "Microsoft.Intune_EndpointProtection_Read",
                        "Microsoft.Intune_EnrollmentProgramToken_Read",
                        "Microsoft.Intune_ManagedApps_Assign",
                        "Microsoft.Intune_ManagedApps_Create",
                        "Microsoft.Intune_ManagedApps_Delete",
                        "Microsoft.Intune_ManagedApps_Read",
                        "Microsoft.Intune_ManagedApps_Update",
                        "Microsoft.Intune_ManagedApps_Wipe",
                        "Microsoft.Intune_ManagedDevices_Read",
                        "Microsoft.Intune_ManagedDevices_ViewReports",
                        "Microsoft.Intune_MicrosoftStoreForBusiness_Read",
                        "Microsoft.Intune_MobileApps_Read",
                        "Microsoft.Intune_MobileApps_ViewReports",
                        "Microsoft.Intune_Organization_Read",
                        "Microsoft.Intune_PolicySets_Read",
                        "Microsoft.Intune_RemoteAssistance_Read",
                        "Microsoft.Intune_RemoteTasks_BypassActivationLock",
                        "Microsoft.Intune_RemoteTasks_CleanPC",
                        "Microsoft.Intune_RemoteTasks_ConfigurationManagerAction",
                        "Microsoft.Intune_RemoteTasks_CustomNotification",
                        "Microsoft.Intune_RemoteTasks_DeviceLogs",
                        "Microsoft.Intune_RemoteTasks_DisableLostMode",
                        "Microsoft.Intune_RemoteTasks_EnableLostMode",
                        "Microsoft.Intune_RemoteTasks_EnableWindowsIntuneAgent",
                        "Microsoft.Intune_RemoteTasks_GetFileVaultKey",
                        "Microsoft.Intune_RemoteTasks_LocateDevice",
                        "Microsoft.Intune_RemoteTasks_ManageSharedDeviceUsers",
                        "Microsoft.Intune_RemoteTasks_PlayLostModeSound",
                        "Microsoft.Intune_RemoteTasks_RebootNow",
                        "Microsoft.Intune_RemoteTasks_RemoteLock",
                        "Microsoft.Intune_RemoteTasks_RequestRemoteAssistance",
                        "Microsoft.Intune_RemoteTasks_ResetPasscode",
                        "Microsoft.Intune_RemoteTasks_Retire",
                        "Microsoft.Intune_RemoteTasks_RevokeAppleVppLicenses",
                        "Microsoft.Intune_RemoteTasks_RotateBitLockerKeys",
                        "Microsoft.Intune_RemoteTasks_RotateFileVaultKey",
                        "Microsoft.Intune_RemoteTasks_SetDeviceName",
                        "Microsoft.Intune_RemoteTasks_ShutDown",
                        "Microsoft.Intune_RemoteTasks_SyncDevice",
                        "Microsoft.Intune_RemoteTasks_UpdateDeviceAccount",
                        "Microsoft.Intune_RemoteTasks_WindowsDefender",
                        "Microsoft.Intune_RemoteTasks_Wipe",
                        "Microsoft.Intune_Reports_Read",
                        "Microsoft.Intune_Roles_Read",
                        "Microsoft.Intune_SecurityBaselines_Read",
                        "Microsoft.Intune_SecurityTasks_Read",
                        "Microsoft.Intune_TelecomExpenses_Read",
                        "Microsoft.Intune_TermsAndConditions_Read",
                        "Microsoft.Intune_WindowsEnterpriseCertificate_Read"
                    ],
                    "notAllowedResourceActions": []
                }
            ]
        }
    ]
}