{
  "displayName": "PAW-Global-{PAWCSMVersion}-Block-Unsupported-SignIn-Risk",
  "state": "enabledForReportingButNotEnforced",
  "sessionControls": null,
  "conditions": {
    "userRiskLevels": [],
    "signInRiskLevels": ["high", "medium"],
    "clientAppTypes": ["all"],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "applications": {
      "includeApplications": ["All"],
      "excludeApplications": [],
      "includeUserActions": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [],
      "includeGroups": ["group-paw-global-users"],
      "excludeGroups": ["group-paw-global-breakglass-accounts"],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": ["block"],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  }
}
