{
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "roleScopeTagIds": ["{tag-paw-csm}"],
  "description": "Compliance settings to apply after 24 hours\n",
  "displayName": "PAW-Global-{PAWCSMVersion}-Delayed",
  "version": 1,
  "passwordRequired": false,
  "passwordBlockSimple": false,
  "passwordRequiredToUnlockFromIdle": false,
  "passwordMinutesOfInactivityBeforeLock": null,
  "passwordExpirationDays": null,
  "passwordMinimumLength": null,
  "passwordMinimumCharacterSetCount": null,
  "passwordRequiredType": "deviceDefault",
  "passwordPreviousPasswordBlockCount": null,
  "requireHealthyDeviceReport": false,
  "osMinimumVersion": "10.0.18363.476",
  "osMaximumVersion": null,
  "mobileOsMinimumVersion": null,
  "mobileOsMaximumVersion": null,
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "bitLockerEnabled": true,
  "secureBootEnabled": true,
  "codeIntegrityEnabled": true,
  "storageRequireEncryption": false,
  "activeFirewallRequired": true,
  "defenderEnabled": true,
  "defenderVersion": null,
  "signatureOutOfDate": true,
  "rtpEnabled": true,
  "antivirusRequired": true,
  "antiSpywareRequired": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "configurationManagerComplianceRequired": false,
  "tpmRequired": true,
  "deviceCompliancePolicyScript": null,
  "validOperatingSystemBuildRanges": [],
  "assignments": [
    {
      "id": "fbbfddaa-2a5f-46a3-b83e-40f73293fc72_de94fc7c-af03-4bd7-8482-84380ff33247",
      "source": "direct",
      "sourceId": "fbbfddaa-2a5f-46a3-b83e-40f73293fc72",
      "target": {
        "@odata.type": "#microsoft.graph.groupAssignmentTarget",
        "deviceAndAppManagementAssignmentFilterId": null,
        "deviceAndAppManagementAssignmentFilterType": "none",
        "groupId": "group-paw-global-users"
      }
    }
  ],
  "scheduledActionsForRule": [
    {
      "id": "fbbfddaa-2a5f-46a3-b83e-40f73293fc72",
      "ruleName": null,
      "scheduledActionConfigurations": [
        {
          "id": "cab389d9-845f-4d0a-a9cd-e64abbcbd859",
          "gracePeriodHours": 24,
          "actionType": "block",
          "notificationTemplateId": "00000000-0000-0000-0000-000000000000",
          "notificationMessageCCList": []
        }
      ]
    }
  ]
}
